Revit 2027 API
ScheduleFilter(ScheduleFieldId, ScheduleFilterType) Constructor
 Creates a new ScheduleFilter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleFilter(
	ScheduleFieldId fieldId,
	ScheduleFilterType filterType
)
Public Sub New (
	fieldId As ScheduleFieldId,
	filterType As ScheduleFilterType
)
public:
ScheduleFilter(
	ScheduleFieldId^ fieldId,
	ScheduleFilterType filterType
)
new :
        fieldId : ScheduleFieldId *
        filterType : ScheduleFilterType -> ScheduleFilter
Parameters
fieldId ScheduleFieldId
 The ID of the field used to filter the schedule.
filterType ScheduleFilterType
 The filter type.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ScheduleFilter Class
ScheduleFilter Overload
Autodesk.Revit.DB Namespace